1s/ERP/extensions/liko/DataProcessors/ЛикоЖурналСкладскихОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЛикоЖурналСкладскихОстатков</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

1s/ERP/extensions/liko/AccumulationRegisters/ТоварыВЯчейках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыВЯчейках</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтбору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КРазмещению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/extensions/liko/Enums/ЯС_ВидыШК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЯС_ВидыШК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШК_Паллета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШК_Адреса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШК_ОбъектаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШК_ЗаявкаНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШК_ОбъектаНоменклатуры_Короткий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/extensions/liko/Documents/РасходныйОрдерНаТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РасходныйОрдерНаТовары</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВсегоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаданиеНаПеревозку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗонаОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтгрузкаПоЗаданиюНаПеревозку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Получатель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПорядокДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РежимПросмотраПоТоварам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладскаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СкладскиеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРасходныхОрдеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_ТипДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТоварыПоРаспоряжениям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Распоряжение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтгружаемыеТовары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЭтоУпаковочныйЛист</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УпаковочныйЛистРодитель</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УпаковочныйЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияСоСтрокамиОрдеровНаОтгрузку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/extensions/liko/DataProcessors/ЛикоЖурналСкладскихОстатков/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные=Элементы.Список.ТекущиеДанные;
	Если ТекДанные<> Неопределено Тогда
		Регистратор=ТекДанные.Регистратор;
		
		Если ЗначениеЗаполнено(Регистратор) Тогда
			ИмяДокумента= ВернутьИмяРегистратораСервер(Регистратор) ;
			Структура = Новый Структура;
			Структура.Вставить("Ключ",Регистратор);
			ОткрытьФорму("Документ."+ИмяДокумента+".Форма.ФормаДокумента",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВернутьИмяРегистратораСервер(Регистратор) //+Лико m.shenderov 17.12.2017  
	//Регистратор=Документы.ПриходныйКассовыйОрдер.НайтиПоНомеру();
	Возврат Регистратор.Метаданные().Имя;
	
КонецФункции  //-Лико m.shenderov 17.12.2017



&НаСервере
Процедура СформироватьНаСервере() //+Лико m.shenderov 17.12.2017
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыВЯчейкахОбороты.Регистратор КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ТоварыВЯчейкахОбороты.Регистратор ССЫЛКА Документ.ПриходныйОрдерНаТовары
	|			ТОГДА ""Поступление товаров""
	|		КОГДА ТоварыВЯчейкахОбороты.Регистратор ССЫЛКА Документ.Лико_БланкЭтапа
	|			ТОГДА ""Закрытие заказа""
	|		КОГДА ТоварыВЯчейкахОбороты.Регистратор ССЫЛКА Документ.Лико_ПередачаТоваров
	|			ТОГДА ТоварыВЯчейкахОбороты.Регистратор.ВидОперации
	|		КОГДА ТоварыВЯчейкахОбороты.Регистратор ССЫЛКА Документ.Лико_ВозвратТоваров
	|			ТОГДА ТоварыВЯчейкахОбороты.Регистратор.ВидОперации
	|		КОГДА ТоварыВЯчейкахОбороты.Регистратор ССЫЛКА Документ.РасходныйОрдерНаТовары
	|			ТОГДА ""Расход товаров""
	|		КОГДА ТоварыВЯчейкахОбороты.Регистратор ССЫЛКА Документ.ПересчетТоваров
	|			ТОГДА ""Пересчет товаров""
	|		КОГДА ТоварыВЯчейкахОбороты.Регистратор ССЫЛКА Документ.ОтборРазмещениеТоваров
	|			ТОГДА ""Перемещение товаров""
	|	КОНЕЦ КАК ВидОперации,
	|	ТоварыВЯчейкахОбороты.Регистратор.Дата КАК Дата,
	|	ТоварыВЯчейкахОбороты.Регистратор.Номер КАК Номер,
	|	ТоварыВЯчейкахОбороты.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОбороты.Упаковка КАК ЕдИзм,
	|	ВЫБОР
	|		КОГДА ТоварыВЯчейкахОбороты.ВНаличииРасход = 0
	|			ТОГДА ТоварыВЯчейкахОбороты.ВНаличииПриход
	|		КОГДА ТоварыВЯчейкахОбороты.ВНаличииПриход = 0
	|			ТОГДА ТоварыВЯчейкахОбороты.ВНаличииРасход
	|		КОГДА ТоварыВЯчейкахОбороты.ВНаличииПриход = ТоварыВЯчейкахОбороты.ВНаличииРасход
	|			ТОГДА ТоварыВЯчейкахОбороты.ВНаличииПриход
	|		ИНАЧЕ -99999
	|	КОНЕЦ КАК Количество,
	|	ТоварыВЯчейкахОбороты.Номенклатура.ЕдиницаИзмерения КАК ЕдИзмУУ,
	|	ВЫБОР
	|		КОГДА ТоварыВЯчейкахОбороты.ВНаличииРасход = 0
	|			ТОГДА ТоварыВЯчейкахОбороты.ВНаличииПриход * ТоварыВЯчейкахОбороты.Упаковка.Числитель
	|		КОГДА ТоварыВЯчейкахОбороты.ВНаличииПриход = 0
	|			ТОГДА ТоварыВЯчейкахОбороты.ВНаличииРасход * ТоварыВЯчейкахОбороты.Упаковка.Числитель
	|		КОГДА ТоварыВЯчейкахОбороты.ВНаличииПриход = ТоварыВЯчейкахОбороты.ВНаличииРасход
	|			ТОГДА ТоварыВЯчейкахОбороты.ВНаличииПриход * ТоварыВЯчейкахОбороты.Упаковка.Числитель
	|		ИНАЧЕ -99999
	|	КОНЕЦ КАК КоличествоУУ,
	|	ТоварыВЯчейкахОбороты.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка КАК Нарезка,
	|	ТоварыВЯчейкахОбороты.Серия.ЯССМ_ОбъектНоменклатуры.Втулка КАК Втулка,
	|	ТоварыВЯчейкахОбороты.Серия.ЯССМ_ОбъектНоменклатуры.НомерПоставки КАК НомерПоставки,
	|	ТоварыВЯчейкахОбороты.Номенклатура.Наименование КАК Наименование,
	|	ТоварыВЯчейкахОбороты.Номенклатура.Артикул КАК Артикул,
	|	ТоварыВЯчейкахОбороты.Номенклатура.Код КАК Код,
	|	ВЫБОР
	|		КОГДА ТоварыВЯчейкахОбороты.Регистратор ССЫЛКА Документ.Лико_БланкЭтапа
	|			ТОГДА ТоварыВЯчейкахОбороты.Регистратор.ЗаказПокупателя
	|		КОГДА ТоварыВЯчейкахОбороты.Регистратор ССЫЛКА Документ.Лико_ПередачаТоваров
	|			ТОГДА ТоварыВЯчейкахОбороты.Регистратор.ЗаказКлиента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказКлиента.Пустаяссылка)
	|	КОНЕЦ КАК Заказ,
	|	ТоварыВЯчейкахОбороты.Регистратор.АвторДокумента КАК АвторДокумента,
	|	ТоварыВЯчейкахОбороты.Регистратор.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Обороты(&ДатаНачала, &ДатаОкончания, Запись, ) КАК ТоварыВЯчейкахОбороты
	|ГДЕ
	|	ТоварыВЯчейкахОбороты.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВЫБОР
	|			КОГДА &ФильтрПоНоменклатуре
	|				ТОГДА ТоварыВЯчейкахОбороты.Номенклатура = &Номенклатура
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ФильтрПоНомеруПоставки
	|				ТОГДА ТоварыВЯчейкахОбороты.Серия.ЯССМ_ОбъектНоменклатуры.НомерПоставки = &НомерПоставки
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ФильтрПоНарезке
	|				ТОГДА ТоварыВЯчейкахОбороты.Серия.ЯССМ_ОбъектНоменклатуры.Нарезка = &Нарезка
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ФильтрПоВтулки
	|				ТОГДА ТоварыВЯчейкахОбороты.Серия.ЯССМ_ОбъектНоменклатуры.Втулка = &Втулка
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ФильтрПоРабочемуЦентру
	|				ТОГДА ТоварыВЯчейкахОбороты.Ячейка = &РабочийЦентр
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И (ТоварыВЯчейкахОбороты.Ячейка.Помещение.Лико_Организация = &Организация
	|			ИЛИ ТоварыВЯчейкахОбороты.Ячейка.Помещение = ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.Пустаяссылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Вт.Регистратор КАК Регистратор,
	|	Вт.ВидОперации КАК ВидОперации,
	|	Вт.Дата КАК Дата,
	|	Вт.Номер КАК Номер,
	|	Вт.Номенклатура КАК Номенклатура,
	|	Вт.ЕдИзм КАК ЕдИзм,
	|	Вт.Количество КАК Количество,
	|	Вт.ЕдИзмУУ КАК ЕдИзмУУ,
	|	Вт.КоличествоУУ КАК КоличествоУУ,
	|	Вт.Нарезка КАК Нарезка,
	|	Вт.Втулка КАК Втулка,
	|	Вт.НомерПоставки КАК НомерПоставки,
	|	Вт.Наименование КАК Наименование,
	|	Вт.Артикул КАК Артикул,
	|	Вт.Код КАК Код,
	|	Вт.Заказ КАК Заказ,
	|	Вт.АвторДокумента КАК АвторДокумента,
	|	Вт.Сотрудник КАК Сотрудник
	|ИЗ
	|	Вт КАК Вт
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ФильтрПоЗаказу
	|				ТОГДА Вт.Заказ = &НомерЗаказаКлиента
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";

	Запрос.УстановитьПараметр("ДатаНачала",ДатаНачала );
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("ФильтрПоНоменклатуре",ЗначениеЗаполнено(Номенклатура));
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	
	Запрос.УстановитьПараметр("ФильтрПоНомеруПоставки",ЗначениеЗаполнено(НомерПоставки));
	Запрос.УстановитьПараметр("НомерПоставки",НомерПоставки);
	
	
	Запрос.УстановитьПараметр("ФильтрПоНарезке",ЗначениеЗаполнено(Нарезка));
	Запрос.УстановитьПараметр("Нарезка",Нарезка);  	
	
	Запрос.УстановитьПараметр("ФильтрПоВтулки",ЗначениеЗаполнено(Втулка));
	Запрос.УстановитьПараметр("Втулка",Втулка);
	
	Запрос.УстановитьПараметр("ФильтрПоРабочемуЦентру",ЗначениеЗаполнено(РабочийЦентр));
	Запрос.УстановитьПараметр("РабочийЦентр",РабочийЦентр.ЛикоЯчейка);
	
	Запрос.УстановитьПараметр("ФильтрПоЗаказу",ЗначениеЗаполнено(ЗаказКлиента));
	Запрос.УстановитьПараметр("НомерЗаказаКлиента",ЗаказКлиента);
	Запрос.УстановитьПараметр("Организация",Организация);

	
	
	
	Список.Загрузить( Запрос.Выполнить().Выгрузить());
	
	КоличествоСписок=Список.Количество();

	СписокПартии.Очистить();  
	КоличествоПартии=0;
	Если ЗначениеЗаполнено(НомерПоставки) Тогда
		 СформироватьПартииСервер()
	КонецЕсли;
	
КонецПроцедуры  //-Лико m.shenderov 17.12.2017

&НаСервере
Процедура СформироватьПартииСервер() //+Лико m.shenderov 29.05.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЯССМ_ОбъектыНоменклатуры.Ссылка КАК ОбъектНоменклатуры,
	|	ЯССМ_ОбъектыНоменклатуры.НомерПартииИзготовления КАК НомерПартииИзготовления,
	|	ЯССМ_ОбъектыНоменклатуры.ПричинаОтсутствияНомераПартииИзготовления КАК ПричинаОтсутствияНомераПартииИзготовления,
	|	ЯССМ_ОбъектыНоменклатуры.ПричинаОтсутствияДатыИзготовления КАК ПричинаОтсутствияДатыИзготовления,
	|	ЯССМ_ОбъектыНоменклатуры.УпотребитьДо КАК УпотребитьДо,
	|	ЯССМ_ОбъектыНоменклатуры.ДатаПроизводства КАК ДатаПроизводства,
	|	ЯССМ_ОбъектыНоменклатуры.ПриходныйОрдер КАК ПриходныйОрдер,
	|	ЯССМ_ОбъектыНоменклатуры.ЗакрытиеБланка КАК ЗакрытиеБланка
	|ИЗ
	|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	|ГДЕ
	|	ЯССМ_ОбъектыНоменклатуры.НомерПоставки = &НомерПоставки
	|	И ЯССМ_ОбъектыНоменклатуры.Номенклатура = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лико_ПартииПроизводства.ПартияОбъектНоменклатуры,
	|	Лико_ПартииПроизводства.ПартияОбъектНоменклатуры.НомерПартииИзготовления,
	|	Лико_ПартииПроизводства.ПартияОбъектНоменклатуры.ПричинаОтсутствияНомераПартииИзготовления,
	|	Лико_ПартииПроизводства.ПартияОбъектНоменклатуры.ПричинаОтсутствияДатыИзготовления,
	|	Лико_ПартииПроизводства.ПартияОбъектНоменклатуры.УпотребитьДо,
	|	Лико_ПартииПроизводства.ПартияОбъектНоменклатуры.ДатаПроизводства,
	|	Лико_ПартииПроизводства.ПартияОбъектНоменклатуры.ПриходныйОрдер,
	|	Лико_ПартииПроизводства.ПартияОбъектНоменклатуры.ЗакрытиеБланка
	|ИЗ
	|	РегистрСведений.Лико_ПартииПроизводства КАК Лико_ПартииПроизводства
	|ГДЕ
	|	Лико_ПартииПроизводства.Серия.ЯССМ_ОбъектНоменклатуры.Номенклатура = &Номенклатура
	|	И Лико_ПартииПроизводства.Серия.ЯССМ_ОбъектНоменклатуры.НомерПоставки = &НомерПоставки";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура );
	Запрос.УстановитьПараметр("НомерПоставки",НомерПоставки ); 
	
	СписокПартии.Загрузить(Запрос.Выполнить().Выгрузить());
	КоличествоПартии=СписокПартии.Количество();
КонецПроцедуры  //-Лико m.shenderov 29.05.2023



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма); 
	ДатаНачала=НачалоГода(ТекущаяДата());
	ДатаОкончания=КонецДня(КонецГода(ТекущаяДата()));
	Структура = Новый Структура;
	Лико_ОбщегоНазначенияСервер.РеквизитыШапки(Структура);
	ЗаполнитьЗначенияСвойств(ЭтаФорма,Структура);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	
КонецПроцедуры


//+ Лико m.shenderov 17.12.2017
#Область Лико_Дополнительно

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	
	Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
	Если Результат.Ошибка <> "" Тогда
		Сообщить(Результат.Ошибка);
	Иначе
		Если Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий") Или 
			Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры") Тогда
			ОбработатьНоменклатуру(Результат);
			//		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Сотрудника") Тогда
			//		//Это физ. лицо
			//		//Объект.Сотрудник = Результат.Сотрудник;
			//		//Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДоплнительно;
			//
			//	ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ЗаказаСпецификации") Тогда
			//		//Объект.ЗаказПокупателя=ПолучитьЗаказКлиентаПоНомеру(Результат.НомерЗаказа);
			//		//Объект.НомерБланка=Результат.НомерБланка;
			//		//ПолучитьНомерПроката();
			//		Попытка 		
			//			//ОписаниеОшибки()
			//			
			//			//Объект.НомерЗаказа=Число(Прав(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.ЗаказПокупателя,"Номер"),7));
			//			
			//		Исключение
			//		КонецПопытки;
			//		
			//		
			//	ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_РабочегоЦентра") Тогда
			//		//Объект.РабочийЦентр=Результат.РабочийЦентр;
			//		//ВводКликов();
			//		
			//	ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Заказа") Тогда
			//		Объект.ЗаказПокупателя=ПолучитьЗаказКлиентаПоНомеру(Результат.НомерЗаказа);
			//		Попытка
			//			
			//			
			//			//ОписаниеОшибки()
			//			
			//			Объект.НомерЗаказа=Число(Прав(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.ЗаказПокупателя,"Номер"),7));
			//			
			//		Исключение
			//		КонецПопытки;
			//		
			//	ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Адреса")
			//		ИЛИ Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Адреса_Короткий") Тогда
			//		//Это ячейка
			//		Объект.ЯчейкаПолучатель = Результат.АдресаХранения;
			//		ЯчейкаПолучательПриИзмененииНаСервере();
			//		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДоплнительно;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура ОбработатьНоменклатуру(Результат) //+Лико m.shenderov 08.12.2017
	Если ЗначениеЗаполнено(Результат.ОбъектНоменклатуры) Тогда
		Номенклатура=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ОбъектНоменклатуры,"Номенклатура");
		НомерПоставки=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ОбъектНоменклатуры,"НомерПоставки");		
		СформироватьНаСервере();
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 08.12.2017


#КонецОбласти
//- Лико m.shenderov 17.12.2017
